In [2]:
import pandas as pd

In [4]:
#create movie dataframe
df_movie_rating = pd.DataFrame({
    'movie1':[5,4,3,2,1],
    'movie2':[3,4,5,3,2]
}, index = ["John", "Mark", "Bruce", "Peter", "Tony"])

In [5]:
df_movie_rating

       movie1  movie2
John        5       3
Mark        4       4
Bruce       3       5
Peter       2       3
Tony        1       2

In [9]:
#Declare a custom function
def movie_grade(rating):
    if rating==5:
        return "A"
    if rating==4:
        return "B"
    if rating==3:
        return "C"
    if rating==2:
        return "D"
    else:
        return "E"

In [10]:
df_movie_rating.applymap(movie_grade)

      movie1 movie2
John       A      C
Mark       B      B
Bruce      C      A
Peter      D      C
Tony       E      D

## Data operations with Statistical Functions

In [11]:
df_test_scores = pd.DataFrame({
    'Test1':[34,45,56,95,66,77],
    'Test2':[45,64,34,56,75,43]
}, index = ['Jack', 'Tony', 'Bruce', 'Peter', 'Arthur', 'Mark'])

In [12]:
df_test_scores.max()

Test1    95
Test2    75
dtype: int64

In [13]:
df_test_scores.min()

Test1    34
Test2    34
dtype: int64

In [14]:
df_test_scores.std()

Test1    22.08544
Test2    15.09194
dtype: float64

## Data Operations using Group By

In [15]:
df_president_name = pd.DataFrame({
    'first':['Rizwan', 'Arsalan', 'Himanshu', 'Asmita', 'Tushar', 'Tushar', 'Asmita'],
    'last':['Shaikh', 'Momin', 'Shukla', 'Khandare', 'Majumdar', 'Shigwan', 'Pawar']
})

In [16]:
df_president_name

      first      last
0    Rizwan    Shaikh
1   Arsalan     Momin
2  Himanshu    Shukla
3    Asmita  Khandare
4    Tushar  Majumdar
5    Tushar   Shigwan
6    Asmita     Pawar

In [17]:
grouped = df_president_name.groupby('first')

In [21]:
grp_data = grouped.get_group('Asmita')

In [22]:
grp_data

    first      last
3  Asmita  Khandare
6  Asmita     Pawar

In [23]:
grp_data = grouped.get_group('Tushar')

In [24]:
grp_data

    first      last
4  Tushar  Majumdar
5  Tushar   Shigwan

In [25]:
df_president_name.sort_values('first')

      first      last
1   Arsalan     Momin
3    Asmita  Khandare
6    Asmita     Pawar
2  Himanshu    Shukla
0    Rizwan    Shaikh
4    Tushar  Majumdar
5    Tushar   Shigwan

## Data Standardization

In [26]:
def standardize_tests(test):
    return (test - test.mean())/ test.std()

In [27]:
standardize_tests(df_test_scores['Test1'])

Jack     -1.275350
Tony     -0.777284
Bruce    -0.279219
Peter     1.486651
Arthur    0.173568
Mark      0.671634
Name: Test1, dtype: float64

In [28]:
def standardized_test_scores(datafrm):
    return datafrm.apply(standardize_tests)

In [30]:
standardized_test_scores(df_test_scores)

           Test1     Test2
Jack   -1.275350 -0.519041
Tony   -0.777284  0.739909
Bruce  -0.279219 -1.247907
Peter   1.486651  0.209825
Arthur  0.173568  1.468775
Mark    0.671634 -0.651562

## Merge, Duplicate and Concatenation

In [31]:
df_student_math = pd.DataFrame({
    'student':['Tom', 'Jack', 'Bruce', 'Arthur', 'Tony'],
    'id':[20,34,33,56,32]
})

In [ ]:
df_student_math = pd.DataFrame({
    'student':['Tom', 'Bruce', 'Tony'],
    'id':[20,33,52]
})